EN_PL_KEYB_PAIRS = {
    "Z": "ၾ",
    "z": "ၽ",
    "X": "ꩪ",
    "x": "ထ",
    "C": "ꧠ",
    "c": "ၶ",
    "V": "ꩮ",
    "v": "လ",
    "B": "\u1086",  # ႆ
    "b": "\u1087",  # ႇ
    "N": " ",
    "n": "ဢ",
    "M": "\u1083",  # ႃ
    "m": "\u1062",  # ၢ
    "<": " ",
    ",": "ယ",
    ">": "?",
    ".": "\u103d",  # ွ
    "?": "၊",
    "/": "။",
    "A": "\u1035",  # ဵ
    "a": "\u1031",  # ေ
    "S": "\u103e",  # ှ
    "s": "\u103b",  # ျ
    "D": "\u102e",  # ီ
    "d": "\u102d",  # ိ
    "F": "\u1085",  # ႅ
    "f": "\u103a",  # ်
    "G": "…",  # …
    "g": "\u1082",  # ႂ
    "H": "\u1036",  # ံ
    "h": "\u1089",  # ႉ
    "J": " ",  #
    "j": "\u1088",  # ႈ
    "K": " ",
    "k": "\u102f",  # ု
    "L": " ",
    "l": "\u1030",  # ူ
    ":": " ",
    ";": "\u1038",  # း
    '"': "႞",
    "'": "\u108a",
    "Q": "ၹ",
    "q": "ၸ",
    "W": "ၻ",
    "w": "တ",
    "E": "ꧣ",
    "e": "ၼ",
    "R": " ",
    "r": "မ",
    "T": " ",
    "t": "\u1084",  # ႄ
    "Y": "\u103c",  # ြ
    "y": "ပ",
    "U": "ၷ",
    "u": "ၵ",
    "I": " ",
    "i": "င",
    "O": "ဝ",
    "o": "သ",
    "P": "[",
    "p": "ၺ",
    "{": "]",
    "[": "ႁ",
    "}": "”",
    "]": '"',
    "|": "႟",
    "\\": "ရ",
    "~": "~",
    "`": "`",
    "!": "႑",
    "1": "1",
    "@": "႒",
    "2": "2",
    "#": "႓",
    "3": "3",
    "$": "႔",
    "4": "4",
    "%": "႕",
    "5": "5",
    "^": "႖",
    "6": "6",
    "&": "႗",
    "7": "7",
    "*": "႘",
    "8": "8",
    "(": "႙",
    "9": "9",
    ")": "႐",
    "0": "0",
    "_": "-",
    "-": "-",
    "+": "+",
    "=": "=",
}

PL_EN_KEYB_PAIRS = {v: k for k, v in EN_PL_KEYB_PAIRS.items()}

EN_PL_TRANSLATE_TABLE = str.maketrans(EN_PL_KEYB_PAIRS)
PL_EN_TRANSLATE_TABLE = str.maketrans(PL_EN_KEYB_PAIRS)


def eng_to_shn(text: str) -> str:
    return text.translate(EN_PL_TRANSLATE_TABLE)


def shn_to_eng(text: str) -> str:
    return text.translate(PL_EN_TRANSLATE_TABLE)
